In [1]:
import numpy as np
import pandas as pd

In [3]:
lst=["Raju","Kamal","Sohan","Kabir","Harpal","Saket"]

In [4]:
pd.DataFrame(lst)

        0
0    Raju
1   Kamal
2   Sohan
3   Kabir
4  Harpal
5   Saket

In [ ]:
data={  "Name"           :["Raju","Kamal","Sohan","Kabir","Harpal","Saket"],
        "Age"            :[25,30,35,36,38,26],
        "Qualification"  :["BCA","MCA","MSC","BBA","BCOM","BA"],
        "City"           :["Kolkata","Mumbai","Delhi","Bengaluru","Chennai","Hyderabaad"]}

df=pd.DataFrame(data)
df[["Name","Qualification"]]
lst=['Testing','Developer','Designer','Programmer','Data Analytics','Data Science']
df['Department']=lst
df

In [7]:
data

{'Name': ['Raju', 'Kamal', 'Sohan', 'Kabir', 'Harpal', 'Saket'],
 'Age': [25, 30, 35, 36, 38, 26],
 'Qualification': ['BCA', 'MCA', 'MSC', 'BBA', 'BCOM', 'BA'],
 'City': ['Kolkata', 'Mumbai', 'Delhi', 'Bengaluru', 'Chennai', 'Hyderabaad']}

In [4]:
data={"one"   :pd.Series([1,2,3,4,5]),
     "two"    :pd.Series([10,20,30,40,50]),
     "three"  :pd.Series([100,200,300,400,500]),
     "four"   :pd.Series([1000,2000,3000,4000,5000])}
df=pd.DataFrame(data)
# Row wise delete all elements
df.drop([1,3],axis=0,inplace=True)
df
# column all elements

df.drop(['two','four'],axis=1,inplace=True)
df

   one  three
0    1    100
2    3    300
4    5    500

##### loc Function

In [5]:
df.loc[1:2,"three":"four"]

Empty DataFrame
Columns: []
Index: [2]

##### iloc Function

In [6]:
df.iloc[1:4,0:4]

   one  three
2    3    300
4    5    500

In [11]:
data={"one"   :pd.Series([1,2,3,4,5]),
     "two"    :pd.Series([10,20,30,40,50]),
     "three"  :pd.Series([100,200,300,400,500]),
     "four"   :pd.Series([1000,2000,3000,4000,5000])}
df=pd.DataFrame(data)

df.iloc[[1,4],[1,2]]

   two  three
1   20    200
4   50    500

In [10]:
data={"one"   :pd.Series([1,2,3,4,5]),
     "two"    :pd.Series([10,20,30,40,50]),
     "three"  :pd.Series([100,200,300,400,500]),
     "four"   :pd.Series([1000,2000,3000,4000,5000])}
df=pd.DataFrame(data)
# Row wise delete all elements
#df.drop([1,3],axis=0,inplace=True)
df
# column all elements

#df.drop(['two','four'],axis=1,inplace=True)
df

df.loc[df["two"]>10,['three','four']]

   three  four
1    200  2000
2    300  3000
3    400  4000
4    500  5000

In [12]:
df=pd.DataFrame({'Name':['A','B','C'],'Age':[10,20,30],'Class':['10th','11th','12th']})
lst=['D',40,'BA']
df.loc[3]=lst
df

  Name  Age Class
0    A   10  10th
1    B   20  11th
2    C   30  12th
3    D   40    BA

In [13]:
df=pd.DataFrame({'Name':['A','B','C'],'Age':[10,20,30],'Class':['10th','11th','12th']})

df.loc[3]=['D',40,'BA']
df

  Name  Age Class
0    A   10  10th
1    B   20  11th
2    C   30  12th
3    D   40    BA

In [15]:
df=pd.DataFrame({'Name':['A','B','C'],'Age':[10,20,30],'Class':['10th','11th','12th']})

df.loc[3]=['D',40,'BA']
df


new_row={'Name':'E', 'Age': 45,'Class':'BSC'}
df.loc[4]=new_row
df

  Name  Age Class
0    A   10  10th
1    B   20  11th
2    C   30  12th
3    D   40    BA
4    E   45   BSC

In [17]:
lst={'Name':'F','Age':35,'Class':'BCA'}
df.loc[5]=lst
df

  Name  Age Class
0    A   10  10th
1    B   20  11th
2    C   30  12th
3    D   40    BA
4    E   45   BSC
5    F   35   BCA

In [8]:
data={"one"   :pd.Series([1,2,3,4,5]),
     "two"    :pd.Series([10,20,30,40,50]),
     "three"  :pd.Series([100,200,300,400,500]),
     "four"   :pd.Series([1000,2000,3000,4000,5000])}
df=pd.DataFrame(data)
print(df.apply(np.mean))

print(df.apply(np.max))

print(df.apply(np.min))

print(df.apply(lambda x: x.max()-x.min()))

one         3.0
two        30.0
three     300.0
four     3000.0
dtype: float64
one         5
two        50
three     500
four     5000
dtype: int64
one         1
two        10
three     100
four     1000
dtype: int64
one         4
two        40
three     400
four     4000
dtype: int64

In [33]:
df.T

          0     1     2     3     4
one       1     2     3     4     5
two      10    20    30    40    50
three   100   200   300   400   500
four   1000  2000  3000  4000  5000

In [34]:
df.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['one', 'two', 'three', 'four'], dtype='object')]

In [35]:
df.ndim

2

In [38]:
df.dtypes

one      int64
two      int64
three    int64
four     int64
dtype: object

In [39]:
df.size

20

In [40]:
df.shape

(5, 4)

In [10]:
df.applymap(lambda x: x**2)

C:\Users\dilka\AppData\Local\Temp\ipykernel_12968\1911323247.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x: x**2)

   one   two   three      four
0    1   100   10000   1000000
1    4   400   40000   4000000
2    9   900   90000   9000000
3   16  1600  160000  16000000
4   25  2500  250000  25000000

##### reindex function
- row wise reindex

In [ ]:
data={"one"   :pd.Series([1,2,3,4,5]),
     "two"    :pd.Series([10,20,30,40,50]),
     "three"  :pd.Series([100,200,300,400,500]),
     "four"   :pd.Series([1000,2000,3000,4000,5000])}
df=pd.DataFrame(data)

df.reindex([2,0,1,3])

- column wise reindex

In [22]:
data={"one"   :pd.Series([1,2,3,4,5]),
     "two"    :pd.Series([10,20,30,40,50]),
     "three"  :pd.Series([100,200,300,400,500]),
     "four"   :pd.Series([1000,2000,3000,4000,5000])}
df=pd.DataFrame(data)

df.reindex(columns=['three','two','one'])
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
4    5   50    500  5000

##### rename function

In [27]:
data={"one"   :pd.Series([1,2,3,4,5]),
     "two"    :pd.Series([10,20,30,40,50]),
     "three"  :pd.Series([100,200,300,400,500]),
     "four"   :pd.Series([1000,2000,3000,4000,5000])}
df=pd.DataFrame(data)

df.rename(columns={'one':'One','two':'Two','three':'Three','four':'Four'},index={0:'a',1:'b',2:'c',3:'d',4:'d'},inplace=True)
df

   One  Two  Three  Four
a    1   10    100  1000
b    2   20    200  2000
c    3   30    300  3000
d    4   40    400  4000
d    5   50    500  5000

In [23]:
data={"one"   :pd.Series([1,2,3,4,5]),
     "two"    :pd.Series([10,20,30,40,50]),
     "three"  :pd.Series([100,200,300,400,500]),
     "four"   :pd.Series([1000,2000,3000,4000,5000])}
df=pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
4    5   50    500  5000

##### sort_values function
- ascending orders

In [5]:
data={"one"   :pd.Series([1,2,3,4,5]),
     "two"    :pd.Series([10,200,80,40,500]),
     "three"  :pd.Series([100,200,300,400,500]),
     "four"   :pd.Series([1000,2000,3000,4000,5000])}
df=pd.DataFrame(data)
df.sort_values(by='two')

   one  two  three  four
0    1   10    100  1000
3    4   40    400  4000
2    3   80    300  3000
1    2  200    200  2000
4    5  500    500  5000

- descending orders

In [6]:
data={"one"   :pd.Series([1,2,3,4,5]),
     "two"    :pd.Series([10,200,80,40,500]),
     "three"  :pd.Series([100,200,300,400,500]),
     "four"   :pd.Series([1000,2000,3000,4000,5000])}
df=pd.DataFrame(data)
df.sort_values(by='two',ascending=False)

   one  two  three  four
4    5  500    500  5000
1    2  200    200  2000
2    3   80    300  3000
3    4   40    400  4000
0    1   10    100  1000

In [19]:
data={"one"   :pd.Series([1,2,3,4,5]),
     "two"    :pd.Series([10,200,80,40,500]),
     "three"  :pd.Series([100,800,300,700,900]),
     "four"   :pd.Series([1000,2000,3000,4000,5000])}
df=pd.DataFrame(data)
df.sort_values(by =['two','three'],ascending=[False,False])

   one  two  three  four
4    5  500    900  5000
1    2  200    800  2000
2    3   80    300  3000
3    4   40    700  4000
0    1   10    100  1000